package M10_Z14;
/*Задача 14
Профессиональный грибник только что составил карту грибных мест в лесу. Лес представляет собой квадрат 10 на 10 километров,
поэтому грибник составил схему леса в виде квадрата 10 на 10 клеток. В каждую клетку грибник написал цифры, чем больше цифра,
тем больше там грибов. Но так как грибник уже стар, чтобы бегать по всему лесу за грибами, да и другие грибники могут
успеть вынести весь лес, вам нужно продумать самый выгодный маршрут и вывести в консоль количество грибов, которые сможет
собрать грибник, если начинает он в самой левой верхней клетке леса, а передвигаться он может только вправо и вниз.
Для решения данной задачи, вы должны реализовать метод findMaxQuantity(), который проанализирует файл forest.txt
и вернёт максимально возможное количество грибов, которые сможет собрать грибник.
Вот как он выглядит:
51;21;93;48;45;100;67;39;18;29
57;43;97;51;92;10;93;32;19;58
63;16;31;16;78;88;90;72;37;67
10;57;64;25;96;50;81;65;91;69
99;43;95;7;40;76;18;34;5;65
35;19;71;77;64;38;62;56;10;2
100;57;27;26;51;33;100;11;53;1
11;79;49;46;37;69;80;31;25;39
22;71;20;23;11;12;39;16;64;34
4;25;87;84;30;48;77;13;40;33
Для данного файла ответ будет: 1204
 */
public class Main {
    public static void main(String[] args) {

    }

    public  static void findMaxQuantity(){

    }
}
